module variables
    !================================================================
    !このモジュールには
    !・変数(変位，速度，加速度，フェーズフィールド)配列の宣言
    !が含まれる．
    !================================================================

    !================================================================
    !このモジュール内で使用される他モジュール
    use mesh
    !================================================================

    implicit none
    !================================================================
    !変数配列の宣言(静的に割りつける配列)
    !================================================================
    !変位
    double precision,dimension(num_nod) :: u
    !速度
    double precision,dimension(num_nod) :: v
    !加速度
    double precision,dimension(num_nod) :: a
    !フェーズフィールド
    double precision,dimension(num_nod) :: c
    !================================================================
end module variables